Config/DataProcessors/ЗаменаТиповыхОперацийДопРеквизитов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЗаменаТиповыхОперацийДопРеквизитов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТиповаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТиповыеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоваяТиповаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТиповыеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполнятьВТранзакции</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОстанавливатьсяПриОшибке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НепосредственнаяЗамена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДокументыДляОбработки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗначенияДопРеквизитов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДополнительныйРеквизит</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РеквизитыТиповыхОпераций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УстанавливатьЗначением</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеРеквизита</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыОпераций</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УстанавливатьПоРеквизиту</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсходныйРеквизит</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РеквизитыТиповыхОпераций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Очищать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяДляФормулы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменять</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УстанавливатьПоУмолчанию</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Config/InformationRegisters/ОперацииДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОперацииДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТиповыеОперации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОперации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументСторнирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьПроводки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсправлениеОшибки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокИсправленияОшибокПрошлыхЛет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыявительОшибки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВыявительОшибокПрошлыхЛет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОшибки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОшибокПрошлыхЛет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйИсполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/ЗначенияДополнительныхРеквизитовОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияДополнительныхРеквизитовОпераций</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыОпераций</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РеквизитОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РеквизитыТиповыхОпераций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Catalogs/РеквизитыТиповыхОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>РеквизитыТиповыхОпераций</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ТиповыеОперации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПоставляемыйРеквизитТиповойОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоставляемыеРеквизитыТиповыхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитПроводки</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяДляФормулы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборЭлементов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыОпераций</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеПоддержки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияПоддержкиТиповыхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ФункциональныеОпции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяФункциональнойОпции</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/DataProcessors/ЗаменаТиповыхОперацийДопРеквизитов/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИдентификаторТипаДокументы = ОбщегоНазначенияБГУПовтИсп.СсылкаИдентификатораОбъектаМетаданных("Документы");
	
	// заполнение из параметров
	
	ЗаполнитьЗначенияСвойств(Объект, Параметры);
	
	Если ЗначениеЗаполнено(Объект.ИдентификаторДокумента) Тогда
		ИнициализироватьСхемуКомпоновкиДанных();
		ИнициализироватьКомпоновщикНастроек();
	КонецЕсли;
	
	Если Параметры.СписокДокументов.Количество() > 0 Тогда
		Для каждого Док Из Параметры.СписокДокументов Цикл
		
			Объект.ДокументыДляОбработки.Добавить().Документ = Док.Значение;
		
		КонецЦикла;
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(КомпоновщикНастроекОбрабатываемыхДокументов.Настройки.Отбор,
			"Документ", Параметры.СписокДокументов, ВидСравненияКомпоновкиДанных.ВСписке,,Истина,
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.НоваяТиповаяОперация) Тогда
		ЗаполнитьДеревоДопРеквизитовНовойОперации();
	КонецЕсли;
	
	Если ТипЗнч(Параметры.ЗаменяемыеРеквизиты) = Тип("Массив") Тогда
		
		ДеревоНовыхЗначений = РеквизитФормыВЗначение("НовыеЗначенияРеквизитов");
		
		Для каждого ЗаменяемыйРеквизит Из Параметры.ЗаменяемыеРеквизиты Цикл
			
			СтрокиРеквизита = ДеревоНовыхЗначений.Строки.НайтиСтроки(Новый Структура("ДополнительныйРеквизит", ЗаменяемыйРеквизит.РеквизитОперации), Истина);
			
			Если СтрокиРеквизита.Количество() > 0 Тогда
				
				СтрокаТекРеквизита = СтрокиРеквизита[0];
				СтрокаТекРеквизита.Изменять = Истина;
				Если ЗначениеЗаполнено(ЗаменяемыйРеквизит.ЗначениеПоУмолчанию)
					И ЗаменяемыйРеквизит.ЗапретитьИзменение Тогда
					СтрокаТекРеквизита.СпособЗаполнения = "По-умолчанию";
				Иначе
					СтрокаТекРеквизита.СпособЗаполнения = "Установить значение";
					СтрокаТекРеквизита.НовоеЗначение = ЗаменяемыйРеквизит.ЗначениеПоУмолчанию;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ЗначениеВРеквизитФормы(ДеревоНовыхЗначений, "НовыеЗначенияРеквизитов");
		
	КонецЕсли;
	
	УстановитьЗаголовокСвернутойГруппы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИдентификаторДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.ОткрытьФормуВыбораИдентификатораОбъектаМетаданных(
		Элемент, ДанныеВыбора, СтандартнаяОбработка,
		Новый Структура("ТекущаяСтрока", Объект.ИдентификаторДокумента), 
		ИдентификаторТипаДокументы);
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторДокументаПриИзменении(Элемент)
	ИнициализироватьСхемуКомпоновкиДанных();
	ИнициализироватьКомпоновщикНастроек();
КонецПроцедуры

&НаКлиенте
Процедура НоваяТиповаяОперацияПриИзменении(Элемент)
	ЗаполнитьДеревоДопРеквизитовНовойОперации();
	
	Для каждого ТекущаяСтрока Из НовыеЗначенияРеквизитов.ПолучитьЭлементы() Цикл
	
		Если ТекущаяСтрока.ЭтоГруппа Тогда
			ИдентификаторСтроки = ТекущаяСтрока.ПолучитьИдентификатор();
			Если НЕ Элементы.НовыеЗначенияРеквизитов.Развернут(ИдентификаторСтроки) Тогда
				Элементы.НовыеЗначенияРеквизитов.Развернуть(ИдентификаторСтроки, Истина);
			КонецЕсли;
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТиповаяОперацияПриИзменении(Элемент)
	ИнициализироватьСхемуКомпоновкиДанных();
	ИнициализироватьКомпоновщикНастроек();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_НовыеЗначенияРеквизитов

&НаКлиенте
Процедура НовыеЗначенияРеквизитовСпособЗаполненияПриИзменении(Элемент)
	ТекущиеДанные = Элементы.НовыеЗначенияРеквизитов.ТекущиеДанные;
	ТекущиеДанные.Изменять = Истина;
	Если ТекущиеДанные.СпособЗаполнения = "Из реквизита операции" Тогда
		Если ЗначениеЗаполнено(ТекущиеДанные.РеквизитОперацииИсточник) Тогда
			Возврат;
		КонецЕсли;
		
		ЗаполнитьРеквизитОперацииИсточник(ЭтотОбъект, ТекущиеДанные);
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НовыеЗначенияРеквизитовСпособЗаполненияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ВыбранноеЗначение = "По-умолчанию"
		И НЕ ЗначениеЗаполнено(Элементы.НовыеЗначенияРеквизитов.ТекущиеДанные.ЗначениеПоУмолчанию) Тогда
		СтандартнаяОбработка = Ложь;
		Сообщить(НСтр("ru = 'Реквизит не может быть заполнен по-умолчанию. Не задано значение по-умолчанию.'"));
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ДокументыДляОбработки

&НаКлиенте
Процедура ДокументыДляОбработкиПриИзменении(Элемент)
	ДокументыДляОбработкиПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьДокументы(Команда)
	ЗаполнитьДокументыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗамену(Команда)
	
	Если Объект.ДокументыДляОбработки.Количество() = 0 Тогда
		
		ПоказатьПредупреждение(,НСтр("ru = 'Не выбраны документы для обработки'"));
		Возврат;
		
	КонецЕсли;
	
	Если НЕ ПроверитьВозможностьВыполненияЗамены() Тогда
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = НСтр("ru = 'Будет выполнена замена типовой операции и/или дополнительных реквизитов в выбранных документах.
			|Перед выполнением операции рекомендуется сделать резервную копию информационной базы.
			|Продолжить?'");
			
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Продолжить'"));
	Кнопки.Добавить(КодВозвратаДиалога.Отмена);
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ВыполнитьЗаменуЗавершение", ЭтотОбъект), ТекстВопроса, Кнопки);
	
КонецПроцедуры

&НаКлиенте
Процедура СопоставитьРеквизиты(Команда)
	СопоставитьРеквизитыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьРеквизиты(Команда)
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ПослеВопросаОчиститьРеквизиты", ЭтотОбъект),
		НСтр("ru = 'Очистить сопоставление реквизитов и установленные значения?'"),
		РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДокументыНаСервере()
	
	Схема = ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных);
	
	НастройкиСхемы = КомпоновщикНастроекОбрабатываемыхДокументов.ПолучитьНастройки();
	
	Если ЗначениеЗаполнено(Объект.ТиповаяОперация) Тогда
		ЭлементОтбора = НастройкиСхемы.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Операция");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Объект.ТиповаяОперация;
		ЭлементОтбора.Использование = Истина;
	Иначе
		ЭлементОтбора = НастройкиСхемы.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Операция");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	КонецЕсли;
	
	ПолеВыбора = НастройкиСхемы.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ПолеВыбора.Поле = Новый ПолеКомпоновкиДанных("Документ");
	
	ГруппировкаСКД = НастройкиСхемы.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	ГруппировкаСКД.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, НастройкиСхемы,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений();
	ТаблицаДокументов=ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	Объект.ДокументыДляОбработки.Загрузить(ТаблицаДокументов);
	
	УстановитьЗаголовокСвернутойГруппы();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокСвернутойГруппы()

	Если Объект.ДокументыДляОбработки.Количество() = 0 Тогда
		ПредставлениеКоличестваДокументов = НСтр("ru = 'Не выбраны документы для изменения'");
		//Элементы.Группа3.ЗаголовокСвернутогоОтображения = НСтр("ru = 'Не выбраны документы для изменения'");
	Иначе
		ПредставлениеКоличестваДокументов = Строка(Объект.ДокументыДляОбработки.Количество());
		//Элементы.Группа3.ЗаголовокСвернутогоОтображения =
		//	СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		//	НСтр("ru = 'Выбранные документы (%1)'"),
		//	Объект.ДокументыДляОбработки.Количество());
	КонецЕсли;
	Элементы.Группа3.ЗаголовокСвернутогоОтображения =
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Выбранные документы (%1)'"),
		ПредставлениеКоличестваДокументов);

КонецПроцедуры // УстановитьЗаголовокСвернутойГруппы()

&НаСервере
Процедура ЗаполнитьДеревоДопРеквизитовНовойОперации()

	НовыеЗначенияРеквизитов.ПолучитьЭлементы().Очистить();
	
	ДопРеквизитыОперации = Справочники.ТиповыеОперации.ДополнительныеРеквизитыТиповойОперации(Объект.НоваяТиповаяОперация, Ложь, "Код,Родитель,ЭтоГруппа,ЗначениеПоУмолчанию");
	
	ДопРеквизитыОперации.Сортировать("Код");
	
	ТекущаяКоллекция = НовыеЗначенияРеквизитов.ПолучитьЭлементы();
	ТребуемыйРодитель = Справочники.РеквизитыТиповыхОпераций.ПустаяСсылка();
	ДобавитьРеквизитыОперацииВДеревоРекурсивно(ДопРеквизитыОперации, ТекущаяКоллекция, ТребуемыйРодитель);

КонецПроцедуры

&НаСервере
Процедура ДобавитьРеквизитыОперацииВДеревоРекурсивно(ДопРеквизитыОперации, ТекущаяКоллекция, ТребуемыйРодитель)
	
	Для каждого ТекДопРеквизитОперации Из ДопРеквизитыОперации Цикл
		
		Если ТекДопРеквизитОперации.Родитель <> ТребуемыйРодитель Тогда
			Продолжить;
		КонецЕсли;
		
		НовыйЭлемент = ТекущаяКоллекция.Добавить();
		НовыйЭлемент.ДополнительныйРеквизит = ТекДопРеквизитОперации.Ссылка;
		НовыйЭлемент.ЭтоГруппа = ТекДопРеквизитОперации.ЭтоГруппа;
		НовыйЭлемент.ИмяДляФормулы = ТекДопРеквизитОперации.ИмяДляФормулы;
		НовыйЭлемент.ОписаниеТипаДопРеквизита = ТекДопРеквизитОперации.РеквизитПроводки;
		НовыйЭлемент.ЗначениеПоУмолчанию = ТекДопРеквизитОперации.ЗначениеПоУмолчанию;
		НовыйЭлемент.НомерКартинки = ?(ТекДопРеквизитОперации.ЭтоГруппа, 0, 3);
		
		Если ТекДопРеквизитОперации.ЭтоГруппа Тогда
			ДобавитьРеквизитыОперацииВДеревоРекурсивно(ДопРеквизитыОперации, НовыйЭлемент.ПолучитьЭлементы(), ТекДопРеквизитОперации.Ссылка)
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьДеревоДопРеквизитовНовойОперации()

&НаСервере
Процедура ИнициализироватьКомпоновщикНастроек()

	КомпоновщикНастроекОбрабатываемыхДокументов.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДанных));

КонецПроцедуры // ИнициализироватьКомпоновщикНастроек()

&НаСервере
Процедура ИнициализироватьСхемуКомпоновкиДанных()

	ОбъектМетаданных = ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(Объект.ИдентификаторДокумента);
	
	ПоляЗапроса = Новый Массив;
	ИсточникиЗапроса = Новый Массив;
	ПараметрыСКД = Новый Структура;
	ПоляДопРеквизитов = Новый Массив;
	ПоляСКД = Новый Массив;
	УсловияСКД = Новый Массив;
	
	ПоляДопРеквизитов.Добавить(Новый Структура("ПутьКДанным, Поле, Заголовок, ТипЗначения",
		"Документ",
		"Документ", ""));
	ПоляДопРеквизитов.Добавить(Новый Структура("ПутьКДанным, Поле, Заголовок, ТипЗначения",
		"Операция",
		"Операция", ""));
	ПоляСКД.Добавить("Документ");
	ПоляСКД.Добавить("Операция");
	
	
	Для Каждого Реквизит Из ОбъектМетаданных.СтандартныеРеквизиты Цикл
		Если Реквизит.Имя = "Ссылка" Тогда
			ПоляЗапроса.Добавить("ТаблицаДокумент.Ссылка КАК Документ");
			УсловияСКД.Добавить("ТаблицаДокумент.Ссылка КАК Документ");
		Иначе
			ПоляЗапроса.Добавить("ТаблицаДокумент." + Реквизит.Имя + " КАК " + Реквизит.Имя);
			УсловияСКД.Добавить("ТаблицаДокумент." + Реквизит.Имя + ".* КАК " + Реквизит.Имя);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Реквизит Из ОбъектМетаданных.Реквизиты Цикл
		ПоляЗапроса.Добавить("ТаблицаДокумент." + Реквизит.Имя + " КАК " + Реквизит.Имя);
		УсловияСКД.Добавить("ТаблицаДокумент." + Реквизит.Имя + ".* КАК " + Реквизит.Имя);
	КонецЦикла;
	
	ИсточникиЗапроса.Добавить(ОбъектМетаданных.ПолноеИмя() + " КАК ТаблицаДокумент");
	
	ПоляЗапроса.Добавить("ЕстьNULL(ОперацииДокументов.Операция, ЗНАЧЕНИЕ(Справочник.ТиповыеОперации.ПустаяСсылка)) КАК Операция");
	
	ИсточникиЗапроса.Добавить("ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОперацииДокументов Как ОперацииДокументов
		|	ПО ТаблицаДокумент.Ссылка = ОперацииДокументов.Документ");
	
	Если ЗначениеЗаполнено(Объект.ТиповаяОперация) Тогда
		
		ДопРеквизиты = Справочники.ТиповыеОперации.ДополнительныеРеквизитыТиповойОперации(Объект.ТиповаяОперация,,"Наименование");
		Индекс = 1;
		
		Для каждого ТекущийДопРеквизит Из ДопРеквизиты Цикл
			
			ПоляЗапроса.Добавить("ЗначенияДопРеквизитов" + Индекс + ".Значение Как ДопРеквизитыОперации_" + ТекущийДопРеквизит.ИмяДляФормулы);
			
			ИсточникиЗапроса.Добавить("ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхРеквизитовОпераций КАК ЗначенияДопРеквизитов" + Индекс + "
			|	ПО ТаблицаДокумент.Ссылка = ЗначенияДопРеквизитов" + Индекс +".Объект
			|	И (ЗначенияДопРеквизитов" + Индекс +".РеквизитОперации = &РеквизитОперации" + Индекс + ")");
			
			ПоляСКД.Добавить("ДопРеквизитыОперации_" + ТекущийДопРеквизит.ИмяДляФормулы + ".*");
			УсловияСКД.Добавить("ЗначенияДопРеквизитов" + Индекс + ".Значение.* КАК ДопРеквизитыОперации_" + ТекущийДопРеквизит.ИмяДляФормулы);

			ПараметрыСКД.Вставить("РеквизитОперации" + Индекс, ТекущийДопРеквизит.Ссылка);
			
			ПоляДопРеквизитов.Добавить(Новый Структура("Поле, ПутьКДанным, Заголовок, ТипЗначения",
				"ДопРеквизитыОперации_" + ТекущийДопРеквизит.ИмяДляФормулы,
				"ДопРеквизитыОперации." + ТекущийДопРеквизит.ИмяДляФормулы,
				ТекущийДопРеквизит.Наименование,
				ТекущийДопРеквизит.ТипЗначения));
				
			НоваяСтрокаТаблицыИмен = СтарыеИменаРеквизитов.Добавить();
			НоваяСтрокаТаблицыИмен.ДополнительныйРеквизит = ТекущийДопРеквизит.Ссылка;
			НоваяСтрокаТаблицыИмен.ИмяДляФормулы = ВРег(ТекущийДопРеквизит.ИмяДляФормулы);
			НоваяСтрокаТаблицыИмен.ОписаниеТипаДопРеквизита = ТекущийДопРеквизит.ТипЗначения;
			
			Индекс = Индекс + 1;
		
		КонецЦикла;
		
	КонецЕсли;

	ТекстЗапроса = СтрШаблон(
	"ВЫБРАТЬ
	|%1
	|{Выбрать
	|%2
	|}
	|ИЗ
	|%3",
	СтрСоединить(ПоляЗапроса, "," + Символы.ПС),
	СтрСоединить(ПоляСКД, "," + Символы.ПС),
	СтрСоединить(ИсточникиЗапроса, Символы.ПС));
	Если УсловияСКД.Количество() > 0 Тогда
		ТекстЗапроса = ТекстЗапроса + СтрШаблон("
		|{ГДЕ
		|%1
		|}",
		СтрСоединить(УсловияСКД, "," + Символы.ПС));
	КонецЕсли;
	
	СхемаКомпоновкиДанных = Новый СхемаКомпоновкиДанных;
	
	ИсточникДанных = СхемаКомпоновкиДанных.ИсточникиДанных.Добавить();
	ИсточникДанных.Имя = "ИсточникДанных1";
	ИсточникДанных.ТипИсточникаДанных = "local";
	
	Для каждого ТребуемыйПараметр Из ПараметрыСКД Цикл
	
		НовыйПараметр = СхемаКомпоновкиДанных.Параметры.Добавить();
		НовыйПараметр.Имя = ТребуемыйПараметр.Ключ;
		НовыйПараметр.Значение = ТребуемыйПараметр.Значение;
		НовыйПараметр.ВключатьВДоступныеПоля = Ложь;
		НовыйПараметр.ОграничениеИспользования = Истина;
	
	КонецЦикла;
	
	НаборДанных = СхемаКомпоновкиДанных.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	НаборДанных.ИсточникДанных = "ИсточникДанных1";
	НаборДанных.АвтоЗаполнениеДоступныхПолей = Ложь;
	НаборДанных.Запрос = ТекстЗапроса;
	НаборДанных.Имя = "НаборДанных1";
	
//	СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных);
	
	ПоляСхемы = НаборДанных.Поля;
	
	Для каждого ОписаниеПоля Из ПоляДопРеквизитов Цикл
	
		НовоеПоле = ПоляСхемы.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		НовоеПоле.ПутьКДанным = ОписаниеПоля.ПутьКДанным;
		НовоеПоле.Поле = ОписаниеПоля.Поле;
		НовоеПоле.Заголовок = ОписаниеПоля.Заголовок;
		Если ЗначениеЗаполнено(ОписаниеПоля.ТипЗначения) Тогда
			НовоеПоле.ТипЗначения = ОписаниеПоля.ТипЗначения;
		КонецЕсли;
		
	
	КонецЦикла;
	
	АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, УникальныйИдентификатор);
	
	ЗаполнитьИсходныйРеквизитИерархически(ЭтаФорма, НовыеЗначенияРеквизитов);

	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьИсходныйРеквизитИерархически(ЭтаФорма, ТекущаяКоллекция)

	Для каждого ЭлементКоллекции Из ТекущаяКоллекция.ПолучитьЭлементы() Цикл
	
		Если ЭлементКоллекции.ЭтоГруппа Тогда
			
			ЗаполнитьИсходныйРеквизитИерархически(ЭтаФорма, ЭлементКоллекции);
			
		Иначе
			
			Если ЭлементКоллекции.СпособЗаполнения = "Из реквизита операции" Тогда
				
				ЭлементКоллекции.РеквизитОперацииИсточник = Неопределено;
				ЗаполнитьРеквизитОперацииИсточник(ЭтаФорма, ЭлементКоллекции);
				
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЦикла;
	

КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗаменуНаСервере()
	
	Объект.ЗначенияДопРеквизитов.Очистить();
	
	ПеренестиРеквизитыДляЗаменаВОбъектРекурсивно(НовыеЗначенияРеквизитов);
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗаменитьЗначения();
КонецПроцедуры

&НаСервере
Процедура ПеренестиРеквизитыДляЗаменаВОбъектРекурсивно(ТекущаяКоллекция)

	Для каждого ЭлементКоллекции Из ТекущаяКоллекция.ПолучитьЭлементы() Цикл
	
		Если ЭлементКоллекции.ЭтоГруппа Тогда
			ПеренестиРеквизитыДляЗаменаВОбъектРекурсивно(ЭлементКоллекции);
		Иначе
			
			НоваяСтрока = Объект.ЗначенияДопРеквизитов.Добавить();
			НоваяСтрока.ДополнительныйРеквизит = ЭлементКоллекции.ДополнительныйРеквизит;
			НоваяСтрока.ИмяДляФормулы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлементКоллекции.ДополнительныйРеквизит, "ИмяДляФормулы");
			НоваяСтрока.Изменять = ЭлементКоллекции.Изменять;
			НоваяСтрока.Очищать = ЭлементКоллекции.СпособЗаполнения = "Очистить";
			НоваяСтрока.УстанавливатьЗначением = ЭлементКоллекции.СпособЗаполнения = "Установить значение";
			НоваяСтрока.ЗначениеРеквизита = ЭлементКоллекции.НовоеЗначение;
			НоваяСтрока.УстанавливатьПоРеквизиту = ЭлементКоллекции.СпособЗаполнения = "Из реквизита операции";
			НоваяСтрока.ИсходныйРеквизит = ЭлементКоллекции.РеквизитОперацииИсточник;
			НоваяСтрока.УстанавливатьПоУмолчанию = ЭлементКоллекции.СпособЗаполнения = "По-умолчанию";
			
		КонецЕсли;
	
	КонецЦикла;

КонецПроцедуры // ПеренестиРеквизитыДляЗаменаВОбъектРекурсивно()

&НаКлиенте
Процедура ВыполнитьЗаменуЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	ОчиститьСообщения();
	
	ВыполнитьЗаменуНаСервере();
	Оповестить("ВыполненаЗаменаРеквизитовОперации");
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Обработка документов закончена'"));

КонецПроцедуры

&НаКлиенте
Функция ПроверитьВозможностьВыполненияЗамены()

	Отказ = Ложь;
	Если Не ЗначениеЗаполнено(Объект.НоваяТиповаяОперация) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,,"Новая типовая операция"),,"Объект.НоваяТиповаяОперация",,Отказ);
		Возврат НЕ Отказ;
	КонецЕсли;
	
	НомерСтроки = 0;
	ПроверитьВозможностьВыполненияЗаменыИерархически(НовыеЗначенияРеквизитов, НомерСтроки, Отказ);
	
	Возврат НЕ Отказ;

КонецФункции // ПроверитьВозможностьВыполненияЗамены()

&НаКлиенте
Процедура ПроверитьВозможностьВыполненияЗаменыИерархически(ТекущаяКоллекция, НомерСтроки, Отказ)

	Для каждого НовоеЗначениеРеквизита Из ТекущаяКоллекция.ПолучитьЭлементы() Цикл
		
		НомерСтроки = НомерСтроки + 1;
		
		Если НовоеЗначениеРеквизита.ЭтоГруппа Тогда
			ПроверитьВозможностьВыполненияЗаменыИерархически(НовоеЗначениеРеквизита, НомерСтроки, Отказ);
		ИначеЕсли НовоеЗначениеРеквизита.Изменять Тогда
			Если Не ЗначениеЗаполнено(НовоеЗначениеРеквизита.СпособЗаполнения) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка",,"Способ заполнения", НомерСтроки, "Новые значения реквизитов"),,
					,"НовыеЗначенияРеквизитов["+(НомерСтроки - 1)+"].СпособЗаполнения",Отказ);
			ИначеЕсли НовоеЗначениеРеквизита.СпособЗаполнения = "Установить значение" Тогда
				Если Не ЗначениеЗаполнено(НовоеЗначениеРеквизита.НовоеЗначение) Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
						ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка",,"Новое значение", НомерСтроки, "Новые значения реквизитов"),,
						,"НовыеЗначенияРеквизитов["+(НомерСтроки - 1)+"].НовоеЗначение",Отказ);
				КонецЕсли;
			ИначеЕсли НовоеЗначениеРеквизита.СпособЗаполнения = "Из реквизита операции" Тогда
				Если Не ЗначениеЗаполнено(НовоеЗначениеРеквизита.РеквизитОперацииИсточник) Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
						ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка",,"Реквизит операции", НомерСтроки, "Новые значения реквизитов"),,
						,"НовыеЗначенияРеквизитов["+(НомерСтроки - 1)+"].РеквизитОперацииИсточник",Отказ);
				КонецЕсли;
			ИначеЕсли НовоеЗначениеРеквизита.СпособЗаполнения = "По-умолчанию" Тогда
				Если Не ЗначениеЗаполнено(НовоеЗначениеРеквизита.ЗначениеПоУмолчанию) Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
						ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка","Корректность","Способ заполнения", НомерСтроки, "Новые значения реквизитов",
						НСтр("ru = 'В настройках доп. реквизита не задано значение по умолчанию'")),,
						,"НовыеЗначенияРеквизитов["+(НомерСтроки - 1)+"].СпособЗаполнения",Отказ);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	
	КонецЦикла;

КонецПроцедуры // ПроверитьВозможностьВыполненияЗаменыИерархически()

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьРеквизитОперацииИсточник(ЭтаФорма, ТекущиеДанные)
	
	//ВРегИмяДляФормулы = ВРег(ТекущиеДанные.ИмяДляФормулы);
	//Для каждого СтрокаИмен Из ЭтаФорма.СтарыеИменаРеквизитов Цикл
	//	
	//	Если СтрокаИмен.ИмяДляФормулы = ВРегИмяДляФормулы Тогда
	//		
	//		ПодходящийТип = Ложь;
	//		Если ТекущиеДанные.ОписаниеТипаДопРеквизита.Типы().Количество() = 1 Тогда
	//			Если СтрокаИмен.ОписаниеТипаДопРеквизита.СодержитТип(ТекущиеДанные.ОписаниеТипаДопРеквизита.Типы()[0]) Тогда
	//				ПодходящийТип = Истина;
	//			КонецЕсли;
	//		КонецЕсли;
	//		
	//		Если ПодходящийТип Тогда
	//			ТекущиеДанные.РеквизитОперацииИсточник = СтрокаИмен.ДополнительныйРеквизит;
	//		КонецЕсли;
	//		
	//		Прервать;
	//	КонецЕсли;
	//	
	//КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДокументыДляОбработкиПриИзмененииНаСервере()
	УстановитьЗаголовокСвернутойГруппы();
КонецПроцедуры

&НаСервере
Процедура СопоставитьРеквизитыНаСервере()

	РеквизитыСтаройОперации = Справочники.ТиповыеОперации.ДополнительныеРеквизитыТиповойОперации(
		Объект.ТиповаяОперация, Истина);
	РеквизитыСтаройОперации.Индексы.Добавить("ИмяДляФормулы");
	
	СопоставитьРеквизитыРекурсивноНаСервере(НовыеЗначенияРеквизитов, РеквизитыСтаройОперации);

КонецПроцедуры

&НаСервере
Процедура СопоставитьРеквизитыРекурсивноНаСервере(ТекущиеДанные, РеквизитыСтаройОперации)

	Для каждого ТекСтрока Из ТекущиеДанные.ПолучитьЭлементы() Цикл
	
		Если ТекСтрока.ЭтоГруппа Тогда
			
			СопоставитьРеквизитыРекурсивноНаСервере(ТекСтрока, РеквизитыСтаройОперации);
			
		Иначе
			
			ТекРеквизит = РеквизитыСтаройОперации.Найти(ТекСтрока.ИмяДляФормулы, "ИмяДляФормулы");
			
			Если ТекРеквизит <> Неопределено Тогда
				
				Если ТекРеквизит.РеквизитПроводки = ТекСтрока.ОписаниеТипаДопРеквизита Тогда
					
					ТекСтрока.СпособЗаполнения = "Из реквизита операции";
					ТекСтрока.РеквизитОперацииИсточник = ТекРеквизит.Ссылка;
					ТекСтрока.Изменять = Истина;
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если НЕ ТекСтрока.Изменять И ЗначениеЗаполнено(ТекСтрока.ЗначениеПоУмолчанию) Тогда
				
				ТекСтрока.Изменять = Истина;
				ТекСтрока.СпособЗаполнения = "По-умолчанию";
				
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОчиститьРеквизиты(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		
		ОчиститьРеквизитыРекурсивно(НовыеЗначенияРеквизитов);
		
	КонецЕсли;

КонецПроцедуры
 

&НаКлиенте
Процедура ОчиститьРеквизитыРекурсивно(ТекущиеДанные)

	Для каждого ТекСтрока Из ТекущиеДанные.ПолучитьЭлементы() Цикл
	
		Если ТекСтрока.ЭтоГруппа Тогда
			
			ОчиститьРеквизитыРекурсивно(ТекСтрока);
			
		Иначе
			
			ТекСтрока.Изменять = Ложь;
			ТекСтрока.СпособЗаполнения = "";
			ТекСтрока.НовоеЗначение = "";
			ТекСтрока.РеквизитОперацииИсточник = "";
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
